app/views/tweets/index.html.erb

SELECT "tweets".* FROM "tweets"
---
	</tr>
<% tweets = Tweet.all %>