app/controllers/tweets_controller.rb

	def index
		if params[:zipcode]
			@tweets = Tweet.where(zipcode: params[:zipcode])
		else
			@tweets = Tweet.all
---
SELECT "tweets".* FROM "tweets"

	def create
		@tweet = Tweet.new(tweet_params)
		@tweet.user_id = session[:user_id]
		if @tweet.save!
---
INSERT INTO "tweets" ("text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["text", "Test"], ["user_id", 1], ["created_at", 2017-04-30 23:28:54 UTC], ["updated_at", 2017-04-30 23:28:54 UTC]]

	def update
		@tweet.text = params[:tweet][:text]
		@tweet.save!
---
UPDATE "tweets" SET "text" = ?, "updated_at" = ? WHERE "tweets"."id" = ?  [["text", "goodbye\r\n"], ["updated_at", 2017-04-26 18:56:25 UTC], ["id", 1]]

	def destroy
		@tweet.destroy!
---
DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 7]]