app/controllers/users_controller.rb

	def create
  	@user = User.new(user_params)
  	if @user.save
---
INSERT INTO "users" ("name", "password_hash", "password_salt", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

	def destroy
		@current_user = nil
		session[:user_id] = nil
		@user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 5]]